:PROPERTIES:
:ID:       df6ccf6a-4cd1-4390-ac98-286f689f5f68
:END:
#+title: user management in linux
#+PROPERTY:  header-args :results raw :dir /ssh:admin@alpha:
* user creation
- you can create a new user using =useradd= on RedHat/CentOS ..etc
- on user creation, you can use the options that came with the =useradd= command to fine tune the new user creation to fit your needs.
** example
- useradd options
#+begin_src sh
  sudo useradd --help
#+end_src

#+RESULTS:
#+begin_example
Usage: useradd [options] LOGIN
       useradd -D
       useradd -D [options]

Options:
  -b, --base-dir BASE_DIR       base directory for the home directory of the
                                new account
  -c, --comment COMMENT         GECOS field of the new account
  -d, --home-dir HOME_DIR       home directory of the new account
  -D, --defaults                print or change default useradd configuration
  -e, --expiredate EXPIRE_DATE  expiration date of the new account
  -f, --inactive INACTIVE       password inactivity period of the new account
  -g, --gid GROUP               name or ID of the primary group of the new
                                account
  -G, --groups GROUPS           list of supplementary groups of the new
                                account
  -h, --help                    display this help message and exit
  -k, --skel SKEL_DIR           use this alternative skeleton directory
  -K, --key KEY=VALUE           override /etc/login.defs defaults
  -l, --no-log-init             do not add the user to the lastlog and
                                faillog databases
  -m, --create-home             create the user's home directory
  -M, --no-create-home          do not create the user's home directory
  -N, --no-user-group           do not create a group with the same name as
                                the user
  -o, --non-unique              allow to create users with duplicate
                                (non-unique) UID
  -p, --password PASSWORD       encrypted password of the new account
  -r, --system                  create a system account
  -R, --root CHROOT_DIR         directory to chroot into
  -P, --prefix PREFIX_DIR       prefix directory where are located the /etc/* files
  -s, --shell SHELL             login shell of the new account
  -u, --uid UID                 user ID of the new account
  -U, --user-group              create a group with the same name as the user
  -Z, --selinux-user SEUSER     use a specific SEUSER for the SELinux user mapping
#+end_example
- creating a new user with the following informations:
  | NAME | GECOS |  UID | SHELL |
  |------+-------+------+-------|
  | foo  | TEST  | 1500 | bash  |
  |------+-------+------+-------|
  #+begin_src sh :results output :var name="boo"
    sudo useradd -c "TEST" -u 1500 -s /bin/bash foo && echo "user created"
  #+end_src

  #+RESULTS:
  user created
* user modification
- =usermod= command is similar to =useradd=, and they have similar options
  #+begin_src sh :results output
    sudo usermod --help
  #+end_src

  #+RESULTS:
  #+begin_example
  Usage: usermod [options] LOGIN

  Options:
    -c, --comment COMMENT         new value of the GECOS field
    -d, --home HOME_DIR           new home directory for the user account
    -e, --expiredate EXPIRE_DATE  set account expiration date to EXPIRE_DATE
    -f, --inactive INACTIVE       set password inactive after expiration
                                  to INACTIVE
    -g, --gid GROUP               force use GROUP as new primary group
    -G, --groups GROUPS           new list of supplementary GROUPS
    -a, --append                  append the user to the supplemental GROUPS
                                  mentioned by the -G option without removing
                                  the user from other groups
    -h, --help                    display this help message and exit
    -l, --login NEW_LOGIN         new value of the login name
    -L, --lock                    lock the user account
    -m, --move-home               move contents of the home directory to the
                                  new location (use only with -d)
    -o, --non-unique              allow using duplicate (non-unique) UID
    -p, --password PASSWORD       use encrypted password for the new password
    -R, --root CHROOT_DIR         directory to chroot into
    -P, --prefix PREFIX_DIR       prefix directory where are located the /etc/* files
    -s, --shell SHELL             new login shell for the user account
    -u, --uid UID                 new UID for the user account
    -U, --unlock                  unlock the user account
    -v, --add-subuids FIRST-LAST  add range of subordinate uids
    -V, --del-subuids FIRST-LAST  remove range of subordinate uids
    -w, --add-subgids FIRST-LAST  add range of subordinate gids
    -W, --del-subgids FIRST-LAST  remove range of subordinate gids
    -Z, --selinux-user SEUSER     new SELinux user mapping for the user account
  #+end_example
  - let's change the name of the user =foo= to =boo=, that's require to change the name of it's home directory also to =/home/boo=
  - from the =--help=, we can see that we need: =-l=,=m= and =-d= options
    #+begin_src sh :var alname="boo"
      sudo usermod -l $alname -md /home/$alname foo 
    #+end_src

    #+RESULTS:
 - Locking an account using =-L= options, what this command realy do is that it adds an exclamation mark (!) before the password field on the =/etc/shadow= file.
   this will make the password *invalid*, hence you can not login to the account
   #+begin_src sh :results output :var name="boo"
     sudo usermod -L $name
     sudo grep $name /etc/shadow | cut -d: -f2
   #+end_src

   #+RESULTS:
   !$6$KT7RKc8wanpTWWNw$U5kRZjJSKj5G3YGH6DNWHi56ZPn2sexPnQe28047vtuTc0tNR1AzPjj1dmwcLJocpsUB6lqKjM213iI/NP1LE.

 - to unlock the account, you just need to use the =-U= option
   #+begin_src sh :results output :var name="boo"
     sudo usermod -U $name
     sudo grep $name /etc/shadow | cut -d: -f2
   #+end_src

   #+RESULTS:
   $6$KT7RKc8wanpTWWNw$U5kRZjJSKj5G3YGH6DNWHi56ZPn2sexPnQe28047vtuTc0tNR1AzPjj1dmwcLJocpsUB6lqKjM213iI/NP1LE.
* user deletion
#+begin_src sh :var name="boo"
  sudo userdel -r $name
#+end_src
- find files that aren't owned by any user or any group
#+begin_src sh
  sudo find / -nouser -nogroup 2>/dev/null
#+end_src

#+RESULTS:
